class script(object):

    START_TXT = """<b>Wᴇʟᴄᴏᴍᴇ, {}! 🚀

Yᴏᴜ’ᴠᴇ ʟᴀɴᴅᴇᴅ ᴀᴛ Aɴɪғʟɪx’s Uʟᴛɪᴍᴀᴛᴇ Lɪɴᴋ Pʀᴏᴠɪᴅᴇʀ Bᴏᴛ — ʏᴏᴜʀ ᴏɴᴇ-sᴛᴏᴘ ʜᴜʙ ғᴏʀ ᴀʟʟ ᴛʜɪɴɢs ᴀɴɪᴍᴇ! 🎬✨

Gᴇᴛ ʀᴇᴀᴅʏ ᴛᴏ ᴇxᴘʟᴏʀᴇ ᴀ ᴡᴏʀʟᴅ ᴏғ ᴘʀᴇᴍɪᴜᴍ ʟɪɴᴋs ᴀɴᴅ ᴇɴᴊᴏʏ sᴇᴀᴍʟᴇss ᴀᴄᴄᴇss ᴛᴏ ʏᴏᴜʀ ғᴀᴠᴏʀɪᴛᴇ ᴄᴏɴᴛᴇɴᴛ. Lᴇᴛ’s ᴅɪᴠᴇ ʀɪɢʜᴛ ɪɴ! 🎉

                          ~𝐵𝑟𝑜𝑢𝑔ℎ𝑡 𝑡𝑜 𝑦𝑜𝑢 𝑏𝑦 𝐴𝑛𝑖𝑓𝑙𝑖𝑥</b>"""

    

    CAPTION = """<pre>✪ {file_name}</pre>
<b>╭────────────────
‎‣ Audio Track : Hindi│#Official
‎‣ Size: {file_size}
╰────────────────</b>
<b>➳ Main Channel :- @Aniflix_Official</b>
<b>➳ Always Visit :-    Aniflix.me</b>""" 


    SHORTENER_API_MESSAGE = """<b>Tᴏ ᴀᴅᴅ ᴏʀ ᴜᴘᴅᴀᴛᴇ ʏᴏᴜʀ Sʜᴏʀᴛɴᴇʀ Wᴇʙsɪᴛᴇ API, /api (ᴀᴘɪ)

            

<b>Ex: /api 𝟼LZǫ𝟾𝟻𝟷sXᴏғғғPHᴜɢɪKQǫ



<b>Cᴜʀʀᴇɴᴛ Wᴇʙsɪᴛᴇ: {base_site}



Cᴜʀʀᴇɴᴛ Sʜᴏʀᴛᴇɴᴇʀ API:</b> `{shortener_api}`



If You Want To Remove Api Then Copy This And Send To Bot - `/api None`"""



    CLONE_START_TXT = """<b>Hᴇʟʟᴏ {},ᴍʏ ɴᴀᴍᴇ {},【ɪ ᴀᴍ ʟᴀᴛᴇꜱᴛ ᴀᴅᴠᴀɴᴄᴇᴅ】ᴀɴᴅ ᴘᴏᴡᴇʀꜰᴜʟ ꜰɪʟᴇ ꜱᴛᴏʀᴇ ʙᴏᴛ +├ᴄᴜꜱᴛᴏᴍ ᴜʀʟ ꜱʜᴏʀᴛɴᴇʀ ꜱᴜᴘᴘᴏʀᴛ┤+  ᢵᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ sᴜᴘᴘᴏʀᴛ ᢴ ᢾᴀɴᴅ ʙᴇꜱᴛ ᴜɪ ᴘᴇʀꜰᴏʀᴍᴀɴᴄᴇᢿ



ɪғ ʏᴏᴜ ᴡᴀɴᴛ ᴛʜɪs ғᴇᴀᴛᴜʀᴇ ᴛʜᴇɴ ᴄʀᴇᴀᴛᴇ ʏᴏᴜʀ ᴏᴡɴ ᴄʟᴏɴᴇ ʙᴏᴛ ғʀᴏᴍ ᴍʏ <a href=https://t.me/Aniflix_Official>ᴘᴀʀᴇɴᴛ</a></b>"""


    ABOUT_TXT = """<b>Wᴇʟᴄᴏᴍᴇ, {}!
Tᴏ ᴛʜᴇ Aɴɪғʟɪx Lɪɴᴋ Pʀᴏᴠɪᴅᴇʀ Bᴏᴛ! 🎌✨

Tʜɪs ʙᴏᴛ ɪs ʏᴏᴜʀ ɢᴏ-ᴛᴏ sᴏᴜʀᴄᴇ ғᴏʀ ǫᴜɪᴄᴋ ᴀɴᴅ ᴇᴀsʏ ᴀᴄᴄᴇss ᴛᴏ ᴅɪʀᴇᴄᴛ ʟɪɴᴋs ғᴏʀ ʏᴏᴜʀ ғᴀᴠᴏʀɪᴛᴇ ᴀɴɪᴍᴇ ᴇᴘɪsᴏᴅᴇs ᴀɴᴅ ᴍᴏᴠɪᴇs. Wʜᴇᴛʜᴇʀ ʏᴏᴜ'ʀᴇ ғᴏʟʟᴏᴡɪɴɢ ᴛʜᴇ ʟᴀᴛᴇsᴛ ʀᴇʟᴇᴀsᴇs ᴏʀ ʀᴇᴠɪsɪᴛɪɴɢ ᴄʟᴀssɪᴄ sᴇʀɪᴇs, ᴡᴇ’ᴠᴇ ɢᴏᴛ ʏᴏᴜ ᴄᴏᴠᴇʀᴇᴅ! 🎥

Fᴇᴀᴛᴜʀᴇs:

🔗 Dɪʀᴇᴄᴛ Aɴɪᴍᴇ Lɪɴᴋs: Iɴsᴛᴀɴᴛʟʏ ʀᴇᴄᴇɪᴠᴇ ʜɪɢʜ-ǫᴜᴀʟɪᴛʏ ᴅᴏᴡɴʟᴏᴀᴅ ᴏʀ sᴛʀᴇᴀᴍɪɴɢ ʟɪɴᴋs ғᴏʀ ᴀɴɪᴍᴇ ᴄᴏɴᴛᴇɴᴛ ᴡɪᴛʜᴏᴜᴛ ᴀɴʏ ᴇxᴛʀᴀ sᴛᴇᴘs.

🎬 Lᴀᴛᴇsᴛ Eᴘɪsᴏᴅᴇs & Mᴏᴠɪᴇs: Sᴛᴀʏ ᴜᴘᴅᴀᴛᴇᴅ ᴡɪᴛʜ ᴅɪʀᴇᴄᴛ ʟɪɴᴋs ᴛᴏ ᴛʜᴇ ɴᴇᴡᴇsᴛ ᴀɴɪᴍᴇ ᴇᴘɪsᴏᴅᴇs ᴀɴᴅ ᴍᴏᴠɪᴇs ᴀs ᴛʜᴇʏ ʀᴇʟᴇᴀsᴇ.

📂 Oʀɢᴀɴɪᴢᴇᴅ Cᴏɴᴛᴇɴᴛ: Eᴀsʏ-ᴛᴏ-ɴᴀᴠɪɢᴀᴛᴇ ʟɪsᴛs ᴏғ ᴇᴘɪsᴏᴅᴇs ᴀɴᴅ ᴍᴏᴠɪᴇs, ɴᴇᴀᴛʟʏ ᴏʀɢᴀɴɪᴢᴇᴅ ғᴏʀ ʜᴀssʟᴇ-ғʀᴇᴇ ᴀᴄᴄᴇss.


Yᴏᴜ ᴡɪʟʟ ғɪɴᴅ ᴍᴏʀᴇ ᴏғ ʏᴏᴜʀ ғᴀᴠᴏʀɪᴛᴇ ʟɪɴᴋs ᴏɴ @Aniflix_Official! 🎉
Fᴀsᴛ, sɪᴍᴘʟᴇ, ᴀɴᴅ ᴛᴀɪʟᴏʀᴇᴅ ғᴏʀ ᴀɴɪᴍᴇ ʟᴏᴠᴇʀs. Eɴᴊᴏʏ sᴇᴀᴍʟᴇss ᴀᴄᴄᴇss ᴛᴏ ʏᴏᴜʀ ғᴀᴠᴏʀɪᴛᴇ sʜᴏᴡs ᴡɪᴛʜ Aɴɪғʟɪx!


-------------------------------------</b>

"""



    CABOUT_TXT = """<b>ʜɪ ɪ ᴀᴍ ᴘᴇʀᴍᴀɴᴇɴᴛ ғɪʟᴇ sᴛᴏʀᴇ ʙᴏᴛ ᴡɪᴛʜ ᴄʟᴏɴᴇ ғᴇᴀᴛᴜʀᴇ + ᴄᴜsᴛᴏᴍ ᴜʀʟ sʜᴏʀᴛɴᴇʀ ɪᴛ ᴍᴇᴀɴs ᴀɴʏ ᴜsᴇʀ  ᴄᴀɴ sᴇᴛ ʜɪs ᴜʀʟ sʜᴏʀᴛɴᴇʀ ᴀɴᴅ + ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ.



🤖 ᴍʏ ɴᴀᴍᴇ: {}



📝 ʟᴀɴɢᴜᴀɢᴇ: <a href=https://www.python.org>𝐏𝐲𝐭𝐡𝐨𝐧𝟑</a>



📚 ʟɪʙʀᴀʀʏ: <a href=https://docs.pyrogram.org>𝐏𝐲𝐫𝐨𝐠𝐫𝐚𝐦</a>



🧑🏻‍💻 ᴅᴇᴠᴇʟᴏᴘᴇʀ: <a href=tg://user?id={}>ᴅᴇᴠᴇʟᴏᴘᴇʀ</a></b>

"""


    CLONE_TXT = """<b>ʜᴇʟʟᴏ {} 👋



First Send /clone command then follow below steps.

    

1) sᴇɴᴅ <code>/newbot</code> ᴛᴏ @BotFather

2) ɢɪᴠᴇ ᴀ ɴᴀᴍᴇ ꜰᴏʀ ʏᴏᴜʀ ʙᴏᴛ.

3) ɢɪᴠᴇ ᴀ ᴜɴɪǫᴜᴇ ᴜsᴇʀɴᴀᴍᴇ.

4) ᴛʜᴇɴ ʏᴏᴜ ᴡɪʟʟ ɢᴇᴛ ᴀ ᴍᴇssᴀɢᴇ ᴡɪᴛʜ ʏᴏᴜʀ ʙᴏᴛ ᴛᴏᴋᴇɴ.

5) ꜰᴏʀᴡᴀʀᴅ ᴛʜᴀᴛ ᴍᴇssᴀɢᴇ ᴛᴏ ᴍᴇ.



ᴛʜᴇɴ ɪ ᴀᴍ ᴛʀʏ ᴛᴏ ᴄʀᴇᴀᴛᴇ ᴀ ᴄᴏᴘʏ ʙᴏᴛ ᴏғ ᴍᴇ ғᴏʀ ʏᴏᴜ ᴏɴʟʏ 😌</b>"""


    HELP_TXT = """<b>💢 Hᴏᴡ Tᴏ Usᴇ Tʜɪs Bᴏᴛ ☺️



🔻 /link - ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴠɪᴅᴇᴏ ᴏʀ ғɪʟᴇ ᴛᴏ ɢᴇᴛ sʜᴀʀᴀʙʟᴇ ʟɪɴᴋ



🔻 /batch - sᴇɴᴅ ғɪʀsᴛ ʟɪɴᴋ ᴏғ ғɪʟᴇ sᴛᴏʀᴇ ᴄʜᴀɴɴᴇʟ ᴘᴏsᴛ ᴛʜᴇɴ ʟᴀsᴛ ᴘᴏsᴛ ʟɪɴᴋ ᴀɴᴅ ᴍᴀᴋᴇ sᴜʀᴇ ʙᴏᴛ ɪs ᴀᴅᴍɪɴ ɪɴ ʏᴏᴜʀ ғɪʟᴇ sᴛᴏʀᴇ ᴄʜᴀɴɴᴇʟ.

ᴇx - /batch https://t.me/Aniflix_Official/25 https://t.me/Aniflix_Official/30



🔻 /base_site - ᴜsᴇ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴛᴏ sᴇᴛ ᴜʀʟ sʜᴏʀᴛɴᴇʀ ʟɪɴᴋ ᴅᴏᴍᴀɪɴ 

ᴇx - /base_site ʏᴏᴜʀᴅᴏᴍᴀɪɴ.ᴄᴏᴍ



🔻 /api - sᴇᴛ ʏᴏᴜʀ ᴜʀʟ sʜᴏʀᴛɴᴇʀ ᴀᴄᴄᴏᴜɴᴛ ᴀᴘɪ 

ᴇx - /api ʙᴀᴏᴡɢᴡᴋʟᴀᴀʙᴀᴋʟ



🔻 /deletecloned - ᴜsᴇ ᴛʜɪs ғᴏʀ ᴅᴇʟᴇᴛᴇ ʏᴏᴜʀ ᴄʟᴏɴᴇ ʙᴏᴛ 

ᴇx - /deletecloned ʏᴏᴜʀʙᴏᴛᴛᴏᴋᴇɴ



🔻 /broadcast - ʀᴇᴘʟʏ ᴛᴏ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴛᴏ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ʙʀᴏᴀᴅᴄᴀsᴛ (ʙᴏᴛ ᴏᴡɴᴇʀ ᴏɴʟʏ)</b>"""


    CHELP_TXT = """<b>💢 Hᴏᴡ Tᴏ Usᴇ Tʜɪs Bᴏᴛ ☺️



🔻 /link - ʀᴇᴘʟʏ ᴛᴏ ᴀ ᴠɪᴅᴇᴏ ᴏʀ ғɪʟᴇ ᴛᴏ ɢᴇᴛ sʜᴀʀᴀʙʟᴇ ʟɪɴᴋ



🔻 /base_site - ᴜsᴇ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴛᴏ sᴇᴛ ᴜʀʟ sʜᴏʀᴛɴᴇʀ ʟɪɴᴋ ᴅᴏᴍᴀɪɴ

ᴇx - /base_site ʏᴏᴜʀᴅᴏᴍᴀɪɴ.ᴄᴏᴍ



🔻 /api - sᴇᴛ ʏᴏᴜʀ ᴜʀʟ sʜᴏʀᴛɴᴇʀ ᴀᴄᴄᴏᴜɴᴛ ᴀᴘɪ

ᴇx - /api ʙᴀᴏᴡɢᴡᴋʟᴀᴀʙᴀᴋʟ



🔻 /broadcast - ʀᴇᴘʟʏ ᴛᴏ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ ᴛᴏ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ʙʀᴏᴀᴅᴄᴀsᴛ (ʙᴏᴛ ᴏᴡɴᴇʀ ᴏɴʟʏ)</b>"""


    LOG_TEXT = """<b>#NewUser

    

ID - <code>{}</code>



Nᴀᴍᴇ - {}</b>

"""

    RESTART_TXT = """

<b>Bᴏᴛ Rᴇsᴛᴀʀᴛᴇᴅ !



📅 Dᴀᴛᴇ : <code>{}</code>

⏰ Tɪᴍᴇ : <code>{}</code>

🌐 Tɪᴍᴇᴢᴏɴᴇ : <code>Asia/Kolkata</code>

🛠️ Bᴜɪʟᴅ Sᴛᴀᴛᴜs: <code>v2.7.1 [ Sᴛᴀʙʟᴇ ]</code></b>"""
